In [1]:
a = "Hello World!"
print(a)

Hello World!

In [3]:
b = 1
c = 3
d = b+c
print(d)

4

In [6]:
#if -esle
a = 10
b = 11
if a>b:
    print("a is greater number ")
else:
    print("b is greater number ")

b is greater number

In [9]:
num = int(input("Enter a number = "))
temp = num
rev = 0
while(num>0):
    dig = num%10
    rev = rev*10+dig
    num = num//10
if (temp==rev):
    print("The number is palindrome")
else:
    print("The number is not a palindrome")

Enter a number = 1584
The number is not a palindrome

In [1]:
#while loop
n = int(input("Enter number "))
i = 1
while i<n:
    print(i)
    i = i +1

Enter number 5
1
2
3
4

In [5]:
a = 0 
while a<5:
    print("Hello World! ")
    a = a+1

Hello World!
Hello World!
Hello World!
Hello World!
Hello World!

In [7]:
n = int(input("Enter a number "))
i = 1
while i<=10:
    print(n,"*",i, "=",n*i)
    i = i+1

Enter a number 9
9 * 1 = 9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81
9 * 10 = 90

In [8]:
fact = 1
i = 1
n = int(input("Enter a number "))
while i<=n:
    fact = fact * i
    i = i +1
print(fact)

Enter a number 5
120

In [10]:
i = 0 
a = "HELLO WORLD!"
l = len(a)
while i<l:
    print(a[i],end = "")
    i = i+1

HELLO WORLD!

In [1]:
i = 0 
a = "HELLO WORLD!"
l = len(a)
while i<l:
    if a[i] == " ":
        break
    print(a[i],end = "")
    i = i+1

HELLO

In [3]:
i =2
n = int(input("Enter n = "))
while i<n:
    if n%i==0:
        print(n,"is composite nimber ")
        break
    i = i +1
else:
    print(n,"is prime number ")

Enter n = 13
13 is prime number

In [6]:
n = int(input("Enter n = "))
i = 1
while i<n:
    print(i * " * ")
    i+=1

Enter n = 5
 *
 *  *
 *  *  *
 *  *  *  *

In [3]:
n = int(input("Enter how many term "))
a = 0 
b = 1
count = 0
while count<n:
    print(a)
    c = a +b
    a = b 
    b = c
    count = count + 1

Enter how many term 10
0
1
1
2
3
5
8
13
21
34

In [5]:
#for loop
for i in range(5):
    print("Hello World!")

Hello World!
Hello World!
Hello World!
Hello World!
Hello World!

In [7]:
n = int(input("Enter n= "))
for i in range(n):
    print(i * " * ")

Enter n= 5

 *
 *  *
 *  *  *
 *  *  *  *

In [12]:
string = input("Enter the string: ")
length = len(string)
for i in range(length):
    for j in range(i+1):
        print(string[j],end="")
    print()

Enter the string: Python
P
Py
Pyt
Pyth
Pytho
Python

In [10]:
n = int(input("Enter the number :"))
for i in range(n,0,-1):
    for j in range(1,i+1):
        print(j,end="")
    print()

Enter the number :5
12345
1234
123
12
1

In [7]:
n = int(input("Enter n = "))
temp = n
rev = 0
while (n>0):
    digit = n%10
    rev = rev*10+digit
    n = n//10
if(temp==rev):
    print("The number is palindrome")
else:
     print("The number is not palindrome")

Enter n = 245
The number is not palindrome

In [10]:
n = int(input("Enter n = "))
temp = n
sum = 0
while (temp>0):
    digit = temp%10
    sum =  sum+digit**3
    temp = temp//10
if(n==sum):
    print("The number is amrstrong")
else:
    print("The number is not amrstong")

Enter n = 407
The number is amrstrong

In [14]:
n =int(input("Enter how many numbers "))
sum = 0
for i in range(n):
    sum = sum + i
print(sum)

Enter how many numbers 10
45

In [16]:
def multiplication_or_sum(num1, num2):
   
    product = num1 * num2
   
    if product <= 1000:
        return product
    else:
      
        return num1 + num2

result = multiplication_or_sum(20, 30)
print("The result is", result)

The result is 600

In [18]:
word = input('Enter word ')
print("Original String:", word)

x = list(word)
for i in x[0::2]:
    print(i , end = "")

Enter word ganesh
Original String: ganesh
gns

In [4]:
#  Write a Python program which accepts the radius of a circle from the user and compute the area.
import math
r = float(input("Enter radius = "))
area = math.pi*r*r
print(area)

Enter radius = 1.1
3.8013271108436504

In [15]:
# #Write a Python program which accepts the user's first and last name and print them in reverse order with a space between them.
# first = input("Enter users first name  ")
# last = input("Enter users last name  ")
# fullname = first +" "+ last
# print(fullname)
fname = input("Input your First Name : ")
lname = input("Input your Last Name : ")
print ("Hello  " + lname + " " + fname)

Input your First Name : Hari
Input your Last Name : Sharma
Hello  Sharma Hari

In [20]:
#Write a Python program to display the first and last colors from the following list. Go to the editor
color_list = ["Red","Green","White" ,"Black"]
print(color_list[0],color_list[-1])

Red Black

In [21]:
# numbers divisible by 5 from a list
num_list = [10, 20, 33, 46, 55]
print("Given list:", num_list)
print('Divisible by 5:')
for num in num_list:
    if num % 5 == 0:
        print(num)

Given list: [10, 20, 33, 46, 55]
Divisible by 5:
10
20
55

In [23]:
#WAP to print first n natural numbers
n = int(input("Enter n = "))
i = 1
while i <= n:
    print(i)
    i += 1

Enter n = 11
1
2
3
4
5
6
7
8
9
10
11

In [31]:
# Print the following pattern
# 1 
# 1 2 
# 1 2 3 
# 1 2 3 4 
# 1 2 3 4 5
for i in range(6):
    for j in range(1,i+1):
        print(j , end =' ' )
    print(' ')

1
1 2
1 2 3
1 2 3 4
1 2 3 4 5

In [33]:
# Calculate the sum of all numbers from 1 to a given number
sum = 0
n = int(input("Enter n = "))
for i in range(1,n+1,1):
    sum = sum+i
print("The sum is ",sum)

Enter n = 10
The sum is  55

In [35]:
# Write a program to print multiplication table of a given number
n = int(input("Enter n = "))
for i in range(1,11,1):
    mul = n *i
    print(mul)

Enter n = 10
10
20
30
40
50
60
70
80
90
100

In [36]:
#Display numbers from a list using loop
numbers = [12, 75, 150, 180, 145, 525, 50]
for item in numbers:
    if item > 500:
        break
    elif item > 150:
        continue
    elif item % 5 == 0:
        print(item)

75
150
145

In [37]:
#Write a program to display all prime numbers within a range
start = 25
end = 50
print("Prime numbers between", start, "and", end, "are:")

for num in range(start, end + 1):
   
    if num > 1:
        for i in range(2, num):
            # check for factors
            if (num % i) == 0:
               
                break
        else:
            print(num)

Prime numbers between 25 and 50 are:
29
31
37
41
43
47

In [38]:
input_number = 6
for i in range(1, input_number + 1):
    print("Current Number is :", i, " and the cube is", (i * i * i))

Current Number is : 1  and the cube is 1
Current Number is : 2  and the cube is 8
Current Number is : 3  and the cube is 27
Current Number is : 4  and the cube is 64
Current Number is : 5  and the cube is 125
Current Number is : 6  and the cube is 216

In [44]:
# Find the sum of the series upto n terms
n = 3
start = 3
sum_seq = 0
for i in range(0, n):
    print(start, end="+")
    sum_seq += start
    start = start * 10 + 3
print("\nSum of above series is:", sum_seq)

3+33+333+
Sum of above series is: 369

In [45]:
rows = 5
for i in range(0, rows):
    for j in range(0, i + 1):
        print("*", end=' ')
    print("\r")

for i in range(rows, 0, -1):
    for j in range(0, i - 1):
        print("*", end=' ')
    print("\r")

*
* *
* * *
* * * *
* * * * *
* * * *
* * *
* *
*

In [46]:
tuple1 = (10, 20, 30, 40, 50)
tuple1 = tuple1[::-1]
print(tuple1)

(50, 40, 30, 20, 10)

In [48]:
tuple1 = ("Orange", [10, 20, 30], (5, 15, 25))

# understand indexing
# tuple1[0] = 'Orange'
# tuple1[1] = [10, 20, 30]
# list1[1][1] = 20

print(tuple1[1][1])

20

In [49]:
a = (50,)
print(type(a))

<class 'tuple'>

In [50]:
tuple1 = (10, 20, 30, 40)

# unpack tuple into 4 variables
a, b, c, d = tuple1
print(a)
print(b)
print(c)
print(d)

10
20
30
40

In [52]:
# swap two tuples in python
tuple1 = (11, 22)
tuple2 = (99, 88)
tuple1, tuple2 = tuple2, tuple1
print(tuple2)
print(tuple1)

(11, 22)
(99, 88)

In [55]:
tuple1 = (11, 22, 33, 44, 55, 66)
tuple2 = tuple1[3:]
print(tuple2)
print(tuple1)

(44, 55, 66)
(11, 22, 33, 44, 55, 66)

In [56]:
tuple1 = (11, [22, 33], 44, 55)
tuple1[1][0] = 222
print(tuple1)

(11, [222, 33], 44, 55)

In [58]:
tuple1 = (50, 10, 60, 70, 50)
print(tuple1.count(50))

2

In [59]:
#SET
sample_set = {"Yellow", "Orange", "Black"}
sample_list = ["Blue", "Green", "Red"]

sample_set.update(sample_list)
print(sample_set)

{'Red', 'Green', 'Orange', 'Black', 'Blue', 'Yellow'}

In [60]:
#Return a new set of identical items from two sets
set1 = {10, 20, 30, 40, 50}
set2 = {30, 40, 50, 60, 70}

print(set1.intersection(set2))

{40, 50, 30}

In [61]:
#Get Only unique items from two sets
set1 = {10, 20, 30, 40, 50}
set2 = {30, 40, 50, 60, 70}

print(set1.union(set2))

{70, 40, 10, 50, 20, 60, 30}

In [62]:
# Check if two sets have any elements in common. If yes, display the common elements
set1 = {10, 20, 30, 40, 50}
set2 = {60, 70, 80, 90, 10}

if set1.isdisjoint(set2):
  print("Two sets have no items in common")
else:
  print("Two sets have items in common")
  print(set1.intersection(set2))

Two sets have items in common
{10}

In [63]:
#Write a Python program to remove items 10, 20, 30 from the following set at once.
set1 = {10, 20, 30, 40, 50}
set1.difference_update({10, 20, 30})
print(set1)

{50, 40}

In [64]:
# Update set1 by adding items from set2, except common items
set1 = {10, 20, 30, 40, 50}
set2 = {30, 40, 50, 60, 70}

set1.symmetric_difference_update(set2)
print(set1)

{20, 70, 10, 60}

In [65]:
# Remove items from set1 that are not common to both set1 and set2
set1 = {10, 20, 30, 40, 50}
set2 = {30, 40, 50, 60, 70}

set1.intersection_update(set2)
print(set1)

{40, 50, 30}

In [68]:
keys = ['Ten', 'Twenty', 'Thirty']
values = [10, 20, 30]
res_dict = dict()
for i in range(len(keys)):
    res_dict.update({keys[i]: values[i]})
print(res_dict)

{'Ten': 10, 'Twenty': 20, 'Thirty': 30}

In [67]:
dict1 = {'Ten': 10, 'Twenty': 20, 'Thirty': 30}
dict2 = {'Thirty': 30, 'Fourty': 40, 'Fifty': 50}

dict3 = dict1.copy()
dict3.update(dict2)
print(dict3)

{'Ten': 10, 'Twenty': 20, 'Thirty': 30, 'Fourty': 40, 'Fifty': 50}

In [69]:
# write a program to accept two numbers from users and calculate multiplication
a  = int(input("Enter first number a = "))
b = int(input("Enter second number b = "))
c = a*b
print(c)

Enter first number a = 8
Enter second number b = 9
72

In [71]:
numbers = []
for i in range(0, 5):
    print("Enter number at location", i, ":")
    item = float(input())

    numbers.append(item)

print("User List:", numbers)

Enter number at location 0 :
25
Enter number at location 1 :
35
Enter number at location 2 :
20
Enter number at location 3 :
77
Enter number at location 4 :
85
User List: [25.0, 35.0, 20.0, 77.0, 85.0]

In [72]:
# total number of digit in a given nummber
num = 75869
count = 0
while num != 0:
    
    num = num // 10

    count = count + 1
print("Total digits are:", count)

Total digits are: 5

In [77]:
n = 5
for i in range(0,n+1):
    for j in range(n-i,0,-1):
        print(j,end=' ')
    print()

5 4 3 2 1
4 3 2 1
3 2 1
2 1
1

In [81]:
list1 = [10, 20, 30, 40, 50]
# reverse list
new_list = reversed(list1)
# iterate reversed list
for item in new_list:
    print(item)

50
40
30
20
10

In [1]:
#function
def info(name,age):
    print(name,age)
info("Ram",23)

Ram 23

In [2]:
#Write a program to create function calculation() such that it can accept two variables and calculate addition and subtraction. Also, it must return both addition and subtraction in a single return call
def calculation(a,b):
    add = a+b
    sub = a-b
    return add, sub
res = calculation(20,15)
print(res)

(35, 5)

In [3]:
# Write a program to create a function show_employee() using the following conditions.

# It should accept the employee’s name and salary and display both.
# If the salary is missing in the function call then assign default value 9000 to salary
def show_employee(name, salary=9000):
    print("Name:", name, "salary:", salary)

show_employee("Hari", 12000)
show_employee("Ram")

Name: Hari salary: 12000
Name: Ram salary: 9000

In [6]:
def outer_fun(a, b):
    square = a ** 2

    
    def addition(a, b):
        return a + b

    
    add = addition(a, b)
    # add 5 to the result
    return add + 5

result = outer_fun(5, 10)
print(result)

20

In [7]:
#Below is the function display_student(name, age). Assign a new name show_tudent(name, age) to it and call it using the new name.
def display_student(name, age):
    print(name, age)

# call using original name
display_student("Emma", 26)

# assign new name
showStudent = display_student
# call using new name
showStudent("Emma", 26)

Emma 26
Emma 26

In [9]:
print(list(range(4,30,2)))

[4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28]

In [19]:
x = [4,6,8,34,23,2]
print(max(x))
print(min(x))
print(sum(x))

34
2
77

In [20]:
name = "Nabin"
print(name)
res = name[0]
l = len(name)
mid = int(l/2)
res = res+ name[mid]
res = res + name[l-1]
print("New string is ", res)

Nabin
New string is  Nbn

In [22]:
str1 = "Far-Western University"
print("The given string is ",str1)
lower = []
upper = []
for char in str1:
    if char.islower():
        lower.append(char)
    else:
        upper.append(char)
sorted_str = ''.join(lower+upper)
print("Result:",sorted_str)

The given string is  Far-Western University
Result: aresternniversityF-W U

In [27]:
def find_digits_chars_symbols(sample_str):
    char_count = 0
    digit_count = 0
    symbol_count = 0
    for char in sample_str:
        if char.isalpha():
            char_count += 1
        elif char.isdigit():
            digit_count += 1
        # if it is not letter or digit then it is special symbol
        else:
            symbol_count += 1

    print("Chars =", char_count, "Digits =", digit_count, "Symbol =", symbol_count)

sample_str = "bhattan848@gmail.com"
print("total counts of chars, Digits, and symbols \n")
find_digits_chars_symbols(sample_str)

total counts of chars, Digits, and symbols

Chars = 15 Digits = 3 Symbol = 2

In [2]:
#matrix using list
row = int(input("Enter rows = "))
col = int(input("Enter columns = "))

matrix = []
for i in range(row):
    temp = []
    for j in range(col):
        a = int(input("Enter elements ="))
        temp.append(a)
    matrix.append(temp)
for i in range(row):
    for j in range(col):
        print(matrix[i][j],end = ' ')
    print()

Enter rows = 3
Enter columns = 3
Enter elements =4
Enter elements =7
Enter elements =8
Enter elements =6
Enter elements =12
Enter elements =47
Enter elements =6
Enter elements =3
Enter elements =99
4 7 8
6 12 47
6 3 99

In [3]:
matrix = [[1,2,3],[4,5,60],[7,9,99]]
for i in range(3):
    for j in range(3):
        print(matrix[i][j],end = ' ')
    print()

1 2 3
4 5 60
7 9 99

In [9]:
#matrix using tuple
matrix = ((1,2,3),(4,5,6),(7,8,9))
for i in range(3):
    for j in range(3):
        print(matrix[i][j],end =' ')
    print()

1 2 3
4 5 6
7 8 9

In [13]:
a = open('abc.txt','x')
a.close()

In [1]:
s = ""
n = int(input("Enter n ="))
for i in range(n):
    name = input("Enter name = ")
    phone = input("Enter phone= ")
    info = name + " "  +phone
    s = s+ " " + info +"\n"

print(s)
with open('abc.txt','a') as file:
    file.write(s)

Enter n =2
Enter name = Ram
Enter phone= 985874595
Enter name = Shyam
Enter phone= 9845645455
 Ram 985874595
 Shyam 9845645455

In [3]:
a = 5
b = 2.5
try:
    print(a/b)
except:
    print("You cannot divide by zero")

2.0

In [1]:
import pandas as pd
df = pd.read_csv('covid.csv', nrows = 6, index_col = '#')
df

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",Tot,...,ppl,New,Cases/1M.1,pop.3,New.1,Deaths/1M.1,pop.4,Active,Cases/1M.2,pop.5
#,,,,,,,,,,,,,,,,,,,,,
1,USA,"80,532,271","+76,222","972,200","+1,853","52,863,682","+201,012","26,696,389","8,985","240,967",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,India,"42,904,744","+10,399","513,512",+254,"42,258,658","+11,774","132,574","8,944","30,594",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Brazil,"28,671,194","+90,199","648,267",+781,"25,994,566","+92,647","2,028,361","8,318","133,322",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,France,"22,593,109","+58,138","137,958",+188,"20,465,162","+214,261","1,989,989","3,055","344,871",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,UK,"18,804,765","+31,933","161,224",+120,"17,153,253","+65,076","1,490,288",289,"274,625",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,Russia,"16,052,028","+123,460","349,365",+787,"13,139,971","+167,310","2,562,692","2,300","109,917",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
import pandas as pd 
df = pd.read_csv('covid.csv', nrows=5, usecols = ['#','Country,Other','TotalCases','NewCases'], index_col='#')
print(df)

  Country,Other  TotalCases NewCases
#
1           USA  80,532,271  +76,222
2         India  42,904,744  +10,399
3        Brazil  28,671,194  +90,199
4        France  22,593,109  +58,138
5            UK  18,804,765  +31,933

In [8]:
import pandas as pd 
df = pd.read_csv('covid.csv',usecols = ['#','Country,Other','TotalCases','NewCases'],index_col='#')
df[df['Country,Other'] == "Nepal"]

   Country,Other TotalCases NewCases
#
57         Nepal    976,670     +158

In [44]:
import pandas as pd 
df = pd.read_csv('covid.csv',usecols = ['#','Country,Other','TotalCases','NewCases'],index_col='#')
df[df['TotalCases'] > 2000]

TypeError: '>' not supported between instances of 'str' and 'int'

In [12]:
import pandas as pd
df = pd.read_csv('covid.csv', index_col='#')
df.iloc[1:5,0:5]

  Country,Other  TotalCases NewCases TotalDeaths NewDeaths
#
2         India  42,904,744  +10,399     513,512      +254
3        Brazil  28,671,194  +90,199     648,267      +781
4        France  22,593,109  +58,138     137,958      +188
5            UK  18,804,765  +31,933     161,224      +120

In [17]:
import pandas as pd
df = pd.read_csv('covid.csv',)
df.loc[1:5]

,#,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",...,ppl,New,Cases/1M.1,pop.3,New.1,Deaths/1M.1,pop.4,Active,Cases/1M.2,pop.5
1,2,India,"42,904,744","+10,399","513,512",+254,"42,258,658","+11,774","132,574","8,944",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,Brazil,"28,671,194","+90,199","648,267",+781,"25,994,566","+92,647","2,028,361","8,318",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,France,"22,593,109","+58,138","137,958",+188,"20,465,162","+214,261","1,989,989","3,055",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,UK,"18,804,765","+31,933","161,224",+120,"17,153,253","+65,076","1,490,288",289,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,6,Russia,"16,052,028","+123,460","349,365",+787,"13,139,971","+167,310","2,562,692","2,300",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [24]:
import pandas as pd
df = pd.read_csv('covid.csv',index_col='#')
df

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",Tot,...,ppl,New,Cases/1M.1,pop.3,New.1,Deaths/1M.1,pop.4,Active,Cases/1M.2,pop.5
#,,,,,,,,,,,,,,,,,,,,,
1,USA,"80,532,271","+76,222","972,200","+1,853","52,863,682","+201,012","26,696,389","8,985","240,967",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,India,"42,904,744","+10,399","513,512",+254,"42,258,658","+11,774","132,574","8,944","30,594",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Brazil,"28,671,194","+90,199","648,267",+781,"25,994,566","+92,647","2,028,361","8,318","133,322",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,France,"22,593,109","+58,138","137,958",+188,"20,465,162","+214,261","1,989,989","3,055","344,871",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,UK,"18,804,765","+31,933","161,224",+120,"17,153,253","+65,076","1,490,288",289,"274,625",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
222,Cook,Islands,9,+1,9,512,"1,309","74,413","17,591",Australia/Oceania,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
223,Marshall,Islands,7,7,0,117,"59,849",Australia/Oceania,"8,550",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
224,Saint,Helena,2,2,0,327,"6,107",Africa,"3,054",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
225,Micronesia,1,1,0,9,"117,012",Australia/Oceania,"117,012",NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
226,China,"108,604",+224,"4,636","101,714",+68,"2,254",18,75,3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df.head()

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",Tot,...,ppl,New,Cases/1M.1,pop.3,New.1,Deaths/1M.1,pop.4,Active,Cases/1M.2,pop.5
#,,,,,,,,,,,,,,,,,,,,,
1,USA,"80,532,271","+76,222","972,200","+1,853","52,863,682","+201,012","26,696,389","8,985","240,967",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,India,"42,904,744","+10,399","513,512",+254,"42,258,658","+11,774","132,574","8,944","30,594",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Brazil,"28,671,194","+90,199","648,267",+781,"25,994,566","+92,647","2,028,361","8,318","133,322",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,France,"22,593,109","+58,138","137,958",+188,"20,465,162","+214,261","1,989,989","3,055","344,871",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,UK,"18,804,765","+31,933","161,224",+120,"17,153,253","+65,076","1,490,288",289,"274,625",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
df.rename(columns={'Country,Other':'Country'})

,Country,TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",Tot,...,ppl,New,Cases/1M.1,pop.3,New.1,Deaths/1M.1,pop.4,Active,Cases/1M.2,pop.5
#,,,,,,,,,,,,,,,,,,,,,
1,USA,"80,532,271","+76,222","972,200","+1,853","52,863,682","+201,012","26,696,389","8,985","240,967",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,India,"42,904,744","+10,399","513,512",+254,"42,258,658","+11,774","132,574","8,944","30,594",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Brazil,"28,671,194","+90,199","648,267",+781,"25,994,566","+92,647","2,028,361","8,318","133,322",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,France,"22,593,109","+58,138","137,958",+188,"20,465,162","+214,261","1,989,989","3,055","344,871",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,UK,"18,804,765","+31,933","161,224",+120,"17,153,253","+65,076","1,490,288",289,"274,625",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
222,Cook,Islands,9,+1,9,512,"1,309","74,413","17,591",Australia/Oceania,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
223,Marshall,Islands,7,7,0,117,"59,849",Australia/Oceania,"8,550",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
224,Saint,Helena,2,2,0,327,"6,107",Africa,"3,054",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
225,Micronesia,1,1,0,9,"117,012",Australia/Oceania,"117,012",NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
226,China,"108,604",+224,"4,636","101,714",+68,"2,254",18,75,3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 226 entries, 1 to 226
Data columns (total 39 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Country,Other     226 non-null    object
 1   TotalCases        226 non-null    object
 2   NewCases          226 non-null    object
 3   TotalDeaths       222 non-null    object
 4   NewDeaths         219 non-null    object
 5   TotalRecovered    218 non-null    object
 6   NewRecovered      220 non-null    object
 7   ActiveCases       223 non-null    object
 8   Serious,Critical  223 non-null    object
 9   Tot               220 non-null    object
 10  Cases/1M          219 non-null    object
 11  pop               215 non-null    object
 12  Deaths/1M         212 non-null    object
 13  pop.1             203 non-null    object
 14  TotalTests        182 non-null    object
 15  Tests/            165 non-null    object
 16  1M                150 non-null    object
 17  pop.2             122 non-null    object
 18  Population        93 non-null     object
 19  Continent         22 non-null     object
 20  1                 4 non-null      object
 21  Caseevery         0 non-null      float64
 22  X                 0 non-null      float64
 23  ppl1              0 non-null      float64
 24  Deathevery        0 non-null      float64
 25  X.1               0 non-null      float64
 26  ppl1.1            0 non-null      float64
 27  Testevery         0 non-null      float64
 28  X.2               0 non-null      float64
 29  ppl               0 non-null      float64
 30  New               0 non-null      float64
 31  Cases/1M.1        0 non-null      float64
 32  pop.3             0 non-null      float64
 33  New.1             0 non-null      float64
 34  Deaths/1M.1       0 non-null      float64
 35  pop.4             0 non-null      float64
 36  Active            0 non-null      float64
 37  Cases/1M.2        0 non-null      float64
 38  pop.5             0 non-null      float64
dtypes: float64(18), object(21)
memory usage: 70.6+ KB

In [17]:
import pandas as pd
df = pd.read_csv('covid_19_data.csv' , index_col ='SNo')
df

,ObservationDate,Province/State,Country/Region,Last Update,Confirmed,Deaths,Recovered
SNo,,,,,,,
1,01/22/2020,Anhui,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
2,01/22/2020,Beijing,Mainland China,1/22/2020 17:00,14.0,0.0,0.0
3,01/22/2020,Chongqing,Mainland China,1/22/2020 17:00,6.0,0.0,0.0
4,01/22/2020,Fujian,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
5,01/22/2020,Gansu,Mainland China,1/22/2020 17:00,0.0,0.0,0.0
...,...,...,...,...,...,...,...
306425,05/29/2021,Zaporizhia Oblast,Ukraine,2021-05-30 04:20:55,102641.0,2335.0,95289.0
306426,05/29/2021,Zeeland,Netherlands,2021-05-30 04:20:55,29147.0,245.0,0.0
306427,05/29/2021,Zhejiang,Mainland China,2021-05-30 04:20:55,1364.0,1.0,1324.0
306428,05/29/2021,Zhytomyr Oblast,Ukraine,2021-05-30 04:20:55,87550.0,1738.0,83790.0
306429,05/29/2021,Zuid-Holland,Netherlands,2021-05-30 04:20:55,391559.0,4252.0,0.0

In [18]:
df.head(10)

,ObservationDate,Province/State,Country/Region,Last Update,Confirmed,Deaths,Recovered
SNo,,,,,,,
1,01/22/2020,Anhui,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
2,01/22/2020,Beijing,Mainland China,1/22/2020 17:00,14.0,0.0,0.0
3,01/22/2020,Chongqing,Mainland China,1/22/2020 17:00,6.0,0.0,0.0
4,01/22/2020,Fujian,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
5,01/22/2020,Gansu,Mainland China,1/22/2020 17:00,0.0,0.0,0.0
6,01/22/2020,Guangdong,Mainland China,1/22/2020 17:00,26.0,0.0,0.0
7,01/22/2020,Guangxi,Mainland China,1/22/2020 17:00,2.0,0.0,0.0
8,01/22/2020,Guizhou,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
9,01/22/2020,Hainan,Mainland China,1/22/2020 17:00,4.0,0.0,0.0
10,01/22/2020,Hebei,Mainland China,1/22/2020 17:00,1.0,0.0,0.0

In [30]:
df.rename(columns={'ObservationDate':'Date','Province/State':'Province','Country/Region':'Country'},inplace = True )
df.head()

,Date,Province,Country,Last Update,Confirmed,Deaths,Recovered
SNo,,,,,,,
1,01/22/2020,Anhui,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
2,01/22/2020,Beijing,Mainland China,1/22/2020 17:00,14.0,0.0,0.0
3,01/22/2020,Chongqing,Mainland China,1/22/2020 17:00,6.0,0.0,0.0
4,01/22/2020,Fujian,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
5,01/22/2020,Gansu,Mainland China,1/22/2020 17:00,0.0,0.0,0.0

In [31]:
df['Date']= pd.to_datetime(df['Date'])
df.head()

,Date,Province,Country,Last Update,Confirmed,Deaths,Recovered
SNo,,,,,,,
1,2020-01-22,Anhui,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
2,2020-01-22,Beijing,Mainland China,1/22/2020 17:00,14.0,0.0,0.0
3,2020-01-22,Chongqing,Mainland China,1/22/2020 17:00,6.0,0.0,0.0
4,2020-01-22,Fujian,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
5,2020-01-22,Gansu,Mainland China,1/22/2020 17:00,0.0,0.0,0.0

In [32]:
df.describe()

          Confirmed         Deaths     Recovered
count  3.064290e+05  306429.000000  3.064290e+05
mean   8.567091e+04    2036.403268  5.042029e+04
std    2.775516e+05    6410.938048  2.015124e+05
min   -3.028440e+05    -178.000000 -8.544050e+05
25%    1.042000e+03      13.000000  1.100000e+01
50%    1.037500e+04     192.000000  1.751000e+03
75%    5.075200e+04    1322.000000  2.027000e+04
max    5.863138e+06  112385.000000  6.399531e+06

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 306429 entries, 1 to 306429
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Date         306429 non-null  datetime64[ns]
 1   Province     228329 non-null  object
 2   Country      306429 non-null  object
 3   Last Update  306429 non-null  object
 4   Confirmed    306429 non-null  float64
 5   Deaths       306429 non-null  float64
 6   Recovered    306429 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(3)
memory usage: 18.7+ MB

In [41]:
df2 = df.groupby('Country')[['Country',
'Confirmed','Deaths','Recovered']].sum().reset_index()
df2.head()

           Country   Confirmed    Deaths   Recovered
0       Azerbaijan         1.0       0.0         0.0
1  ('St. Martin',)         2.0       0.0         0.0
2      Afghanistan  17026442.0  669075.0  13464399.0
3          Albania  19768869.0  375955.0  13945256.0
4          Algeria  27684358.0  834464.0  18959299.0

In [43]:
df3 = df2[df2['Confirmed']>100]
df3.head(10)

                Country    Confirmed      Deaths    Recovered
2           Afghanistan   17026442.0    669075.0   13464399.0
3               Albania   19768869.0    375955.0   13945256.0
4               Algeria   27684358.0    834464.0   18959299.0
5               Andorra    2379802.0     32100.0    2162473.0
6                Angola    4764863.0    116489.0    3683041.0
7   Antigua and Barbuda     143868.0      4059.0     109958.0
8             Argentina  504802880.0  12112441.0  438750295.0
9               Armenia   42536277.0    770759.0   37101575.0
11            Australia    9447438.0    268435.0    7219933.0
12              Austria   97965875.0   1678309.0   89050545.0